app/Controllers/Produk.php

    public function index()
    {
        $data = [
            'title' => 'Produk',
            'produk' => $this->ProdukModel->findAll(),
        ];
---
SELECT *
FROM `produk`

    public function tambah_produk()
    {
        $data = [
            'nama_produk' => $this->request->getVar('nama_produk'),
            'keterangan' => $this->request->getVar('keterangan'),
            'harga' => $this->request->getVar('harga'),
            'jumlah' => $this->request->getVar('jumlah'),
        ];
        $this->ProdukModel->save($data);
---
INSERT INTO `produk` (`nama_produk`, `keterangan`, `harga`, `jumlah`) VALUES ('Rexus G11', 'Mosue gaming ', '129000', '12')

    public function edit_produk()
    {
        $data = [
            'id_produk' => $this->request->getVar('id'),
            'nama_produk' => $this->request->getVar('nama_produk'),
            'keterangan' => $this->request->getVar('keterangan'),
            'harga' => $this->request->getVar('harga'),
            'jumlah' => $this->request->getVar('jumlah'),
        ];
        $this->ProdukModel->save($data);
---
UPDATE `produk` SET `nama_produk` = 'Keychorn02', `keterangan` = 'Keyboard mechanical', `harga` = '2500000', `jumlah` = '50'
WHERE `produk`.`id_produk` IN ('7')